## Estadistica Aplicada 
Sesión 3 - 15 agosto

Francisco Javier Chavez Hernandez 2034204

## Tuplas
Es una colección de objetos inmutables (no se puede cambiar)

In [1]:
tupla_alumno=('Javier', 'Chavez', 21)

In [2]:
type(tupla_alumno)

tuple

In [3]:
tupla_alumno.append('LCC')

AttributeError: 'tuple' object has no attribute 'append'

In [4]:
tupla_alumno.remove('Javier')

AttributeError: 'tuple' object has no attribute 'remove'

In [5]:
tupla_alumno[1]

'Chavez'

## Diccionarios (mapeo de valores)
Se compone de claves-valor
variables-valor

In [6]:
dic1_alumno={'Nombre':'Ricardo','Apellido':'Gomez'}

In [7]:
type(dic1_alumno)

dict

In [8]:
grupo_g44={'Nombre':['Ricardo','Ale','Jimena'],'Apellido':['Perez','Peña', 'Huerta']}

In [9]:
grupo_g44

{'Nombre': ['Ricardo', 'Ale', 'Jimena'],
 'Apellido': ['Perez', 'Peña', 'Huerta']}

In [10]:
grupo_g44['Nombre']

['Ricardo', 'Ale', 'Jimena']

In [11]:
grupo_g44.keys()

dict_keys(['Nombre', 'Apellido'])

In [13]:
grupo_g44.values()

dict_values([['Ricardo', 'Ale', 'Jimena'], ['Perez', 'Peña', 'Huerta']])

## Pandas
Es una libreria para manejar datos estructurados.

Pandas está construida sobre numpy, por tanto las funciones de numpy se pueden usar en pandas.

Pandas nos ofrece tres tipos de datos:
1. Series (unidimensionales)
2. Data frames (filas y columnas)
3. Panel ( tiempo como variable)

Conocemos la edad de cuatro personas: Juan 23, Jimena 21, Jorge 9, Ricardo 15.

In [14]:
edades=[23,21,9,15]

In [15]:
edades

[23, 21, 9, 15]

In [16]:
import pandas as pd

In [17]:
serie_edades=pd.Series(edades, index=['Juan','Jimena', 'Jorge','Ricardo'])

In [18]:
type(serie_edades)

pandas.core.series.Series

In [19]:
serie_edades

Juan       23
Jimena     21
Jorge       9
Ricardo    15
dtype: int64

In [20]:
serie_edades.mean()

17.0

In [21]:
serie_edades.std()

6.324555320336759

In [24]:
serie_edades.std(ddof=1).round(1)

6.3

In [26]:
serie_edades.median()

18.0

## DataFrames
datos organizados en filas y columnas (excel)

In [70]:
alumno1=['Juan','Perez',23]
alumno2=['Raul Gonzalez','Perez',17]
alumno3=['Jimena','Rosas',20]
alumno4=['Alejandra','seldaña',21]

In [71]:
clase_estadistica=[alumno1, alumno2,alumno3, alumno4]

In [72]:
clase_estadistica

[['Juan', 'Perez', 23],
 ['Raul Gonzalez', 'Perez', 17],
 ['Jimena', 'Rosas', 20],
 ['Alejandra', 'seldaña', 21]]

In [73]:
df_clase=pd.DataFrame(clase_estadistica, columns=['Nombre','Apellido','Edad'])

In [74]:
df_clase

          Nombre Apellido  Edad
0           Juan    Perez    23
1  Raul Gonzalez    Perez    17
2         Jimena    Rosas    20
3      Alejandra  seldaña    21

In [75]:
df_clase.columns

Index(['Nombre', 'Apellido', 'Edad'], dtype='object')

In [76]:
df_clase.index

RangeIndex(start=0, stop=4, step=1)

In [77]:
df_clase['Edad en días']=df_clase['Edad']*365

In [78]:
df_clase

          Nombre Apellido  Edad  Edad en días
0           Juan    Perez    23          8395
1  Raul Gonzalez    Perez    17          6205
2         Jimena    Rosas    20          7300
3      Alejandra  seldaña    21          7665

## Seleccion de elementos del dataframe
1. Estandar
2. .iloc
3. .loc
4. Condicionales

In [79]:
## Estándar
df_clase['Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [80]:
df_clase[['Nombre','Edad']]

          Nombre  Edad
0           Juan    23
1  Raul Gonzalez    17
2         Jimena    20
3      Alejandra    21

In [81]:
df_clase[0]

KeyError: 0

In [ ]:
df_clase[0:2]

          Nombre Apellido  Edad  Edad en días
0           Juan    Perez    23          8395
1  Raul Gonzalez    Perez    17          6205

In [ ]:
df_clase[0:2]['Edad']

0    23
1    17
Name: Edad, dtype: int64

## Seleccion por .iloc (posicion)
Dataframe.iloc[filas, columnas]

In [84]:
df_clase.iloc[0,[0,1]]

Nombre       Juan
Apellido    Perez
Name: 0, dtype: object

## Seleccion por etiquetas .loc
dataframe.loc[nombrefilas, nombrecolumnas]

In [85]:
df_clase.loc[:,'Edad']

0    23
1    17
2    20
3    21
Name: Edad, dtype: int64

In [86]:
# cambiar el index
df_clase=df_clase.set_index('Nombre')

In [87]:
df_clase

              Apellido  Edad  Edad en días
Nombre
Juan             Perez    23          8395
Raul Gonzalez    Perez    17          6205
Jimena           Rosas    20          7300
Alejandra      seldaña    21          7665

In [88]:
df_clase.loc['Juan','Apellido']

'Perez'

In [89]:
df_clase.loc['Juan','Edad']

23

In [90]:
## Seleccion SQL
df_clase.Edad

Nombre
Juan             23
Raul Gonzalez    17
Jimena           20
Alejandra        21
Name: Edad, dtype: int64

## Seleccion con condiciones
Dataframe[condicion]

In [91]:
df_clase[df_clase['Edad']>=18]

          Apellido  Edad  Edad en días
Nombre
Juan         Perez    23          8395
Jimena       Rosas    20          7300
Alejandra  seldaña    21          7665

# Funciones de pandas

In [92]:
## sort_values, default es de menor a mayor

df_clase.sort_values('Edad')

              Apellido  Edad  Edad en días
Nombre
Raul Gonzalez    Perez    17          6205
Jimena           Rosas    20          7300
Alejandra      seldaña    21          7665
Juan             Perez    23          8395

In [95]:
## sort_values, de mayor a menor

df_clase.sort_values('Edad',ascending=0)

              Apellido  Edad  Edad en días
Nombre
Juan             Perez    23          8395
Alejandra      seldaña    21          7665
Jimena           Rosas    20          7300
Raul Gonzalez    Perez    17          6205

In [96]:
# dos columnas al mismo tiempo
df_clase.sort_values(['Nombre','Edad'])

              Apellido  Edad  Edad en días
Nombre
Alejandra      seldaña    21          7665
Jimena           Rosas    20          7300
Juan             Perez    23          8395
Raul Gonzalez    Perez    17          6205

In [97]:
## 
df_clase['Edad'].mean()

20.25

In [98]:
df_clase['Edad'].max()

23

In [99]:
import numpy as np

In [100]:
# np.where (condicion, valor si se cumple, valor si no se cumple)
df_clase['Mayoria_edad']=np.where(df_clase['Edad']>=18,'Mayor', 'Menor')

In [101]:
df_clase

              Apellido  Edad  Edad en días Mayoria_edad
Nombre
Juan             Perez    23          8395        Mayor
Raul Gonzalez    Perez    17          6205        Menor
Jimena           Rosas    20          7300        Mayor
Alejandra      seldaña    21          7665        Mayor

In [102]:
# np.select 
#condiciones, valor para cada condicion, valor si no se cumple ninguna condicion

condiciones=[df_clase['Edad']<=17,
             df_clase['Edad']<23,
             df_clase['Edad']>=23]
valores=['Prepa','Universidad','Trabajando']

df_clase['Situacion']=np.select(condiciones, valores, default='Invalido')

In [103]:
df_clase

              Apellido  Edad  Edad en días Mayoria_edad    Situacion
Nombre
Juan             Perez    23          8395        Mayor   Trabajando
Raul Gonzalez    Perez    17          6205        Menor        Prepa
Jimena           Rosas    20          7300        Mayor  Universidad
Alejandra      seldaña    21          7665        Mayor  Universidad

In [105]:
# contar
df_clase['Mayoria_edad'].count()

4

In [107]:
df_clase.groupby('Mayoria_edad').count()['Edad']

Mayoria_edad
Mayor    3
Menor    1
Name: Edad, dtype: int64

In [108]:
df_clase.groupby('Mayoria_edad').mean(numeric_only=True).round(1)

              Edad  Edad en días
Mayoria_edad
Mayor         21.3        7786.7
Menor         17.0        6205.0